English/TED-Ed/2013-10-08 The operating system of life.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-09 Thu 23:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org9054301" class="outline-2">
<h2 id="org9054301">2013-10-08 The operating system of life</h2>
<div class="outline-text-2" id="text-org9054301">
<p class="verse">
Every chicken was once an egg, every oak tree an acorn, every frog a tadpole.<br />
The patch of mold on that old piece of bread in the back of your fridge,<br />
&#xa0;not so long ago was one solitary cell.<br />
Even you were once but a gleam in your parents' eyes.<br />
All these organisms share the same basic goal: to perpetuate their own existence.<br />
<br />
All lifeforms that we've discovered so far<br />
&#xa0;stay alive by using basically the same rules, materials, and machinery.<br />
Imagine a factory full of robots.<br />
These robots have two missions:<br />
&#xa0;one, keep the factory running, and two, when the time is right, set up an entirely new factory.<br />
To do those things, they need assembly instructions, raw materials, plenty of energy,<br />
&#xa0;a few rules about when to work normally, when to work quickly, or when to stop,<br />
&#xa0;&#xa0;and some exchange currencies because even robots need to get paid.<br />
Each factory has a high security office with blueprints<br />
&#xa0;for all the possible factory configurations<br />
&#xa0;&#xa0;and complete sets of instructions to make all the different types of robots<br />
&#xa0;&#xa0;&#xa0;a factory could ever need.<br />
Special robots photocopy these instructions and send them off<br />
&#xa0;to help make the building blocks of more robots.<br />
Their colleagues assemble those parts into still more robots,<br />
&#xa0;which are transported to the right location in the factory<br />
&#xa0;&#xa0;and given the tools they need to start working.<br />
Every robot draws energy from the central power plant,<br />
&#xa0;a giant furnace that can burn regular fuel<br />
&#xa0;&#xa0;but also scrap materials if not enough regular fuel is available.<br />
Certain zones in the factory have harsher working conditions,<br />
&#xa0;so these areas are walled off.<br />
But the robots inside can at least communicate with the rest of the factory<br />
&#xa0;through specialized portals embedded directly into the walls.<br />
<br />
And as you've probably figured out,	what we're describing here is a cell.<br />
The high security office is the nucleus.<br />
It stores the blueprints and instructions as deoxyribonucleic acid, or DNA.<br />
The photocopied instructions are RNA.<br />
The robots themselves are mostly proteins built from amino acids,<br />
&#xa0;but they'll often use special tools that are, or are derived from, vitamins and minerals.<br />
The walls between factory zones and around the factory itself<br />
&#xa0;are mostly made up of lipids, a.k.a. fats.<br />
In most organisms, the primary fuel source are sugars,<br />
&#xa0;but in a pinch, fats and proteins can be broken down and burned in the furnace as well.<br />
The portals are membrane proteins<br />
&#xa0;which allow very specific materials and information to pass through the walls at the right times.<br />
Many interactions between robot proteins require some kind of push, think robot minimum wage.<br />
A few small but crucial forms of money are transferred between proteins to provide this push.<br />
Electrons, protons, oxygen, and phosphate groups are the main chemical currencies,<br />
&#xa0;and they're kept in small molecular wallets or larger tote bags to keep them safe.<br />
This is biochemistry,<br />
&#xa0;the study of how every part of the factory interacts<br />
&#xa0;&#xa0;to keep your life running smoothly in the face of extreme challenges.<br />
<br />
Maybe there's too much fuel; your body will store the excess as glycogen or fat.<br />
Maybe there's not enough; your body will use up those energy reserves.<br />
Maybe a virus or bacteria tries to invade; your body will mobilize the immune system.<br />
Maybe you touched something hot or sharp; your nerves will let you know so you can stop.<br />
Maybe it's time to create a new cell or a new person.<br />
Amazingly, oak trees, chickens, frogs,<br />
&#xa0;and, yes, even you share so many of the same basic robot and factory designs<br />
&#xa0;&#xa0;that biochemists can learn a lot about all of them all at the same time.<br />
</p>
</div>
