English/TED-Ed/2013-10-08 The operating system of life.org
** expression
oak [əʊk]: n. a large tree that is common in northern countries, or the hard wood of this tree橡树, 橡木
acorn [ˈeɪˌkɔrn]: n. the nut of the ↑oak tree[植]橡树果
tadpole [ˈtædˌpoʊl]: n. a small creature that has a long tail, lives in water, and grows into a frog or toad[动]蝌蚪
mold [moʊld]: n. a soft green, grey, or black substance that grows on food which has been kept too long, and on objects that are in warm wet air ⇨ mouldy:霉菌 
solitary [ˈsɑləˌteri]: adj. used to emphasize that there is only one of something SYN single孤独的
lifeform : n. 生物
machinery [məˈʃinəri]: n. machines, especially large ones[总称] 机器, 机械
mission [ˈmɪʃ(ə)n]: n. something that you feel you must do because it is your duty SYN calling, vocation使命, 任务
currency [ˈkʌrənsi]: n. the system or type of money that a country uses货币
blueprint [ˈbluˌprɪnt]: n. technical a pattern that all living cells contain, which decides how a person, animal, or plant develops and what it looks like蓝图
photocopy [ˈfoʊtoʊˌkɑpi]: v. to make a photographic copy of something影印
giant [ˈdʒaɪənt]: adj. extremely big, and much bigger than other things of the stype庞大的, 巨大的
furnace [ˈfɜrnɪs]: n. a large container for a very hot fire, used to produce power, heat, or liquid metal炉子, 熔炉
fuel [ˈfjuːəl]: n. a substance such as coal, gas, or oil that can be burned to produce heat or energy燃料
scrap [skræp]: v. to get rid of an old machine, vehicle etc, and use its parts in some other way拆毁
specialized [ˈspeʃ(ə)lˌaɪzd]: adj. trained, designed, or developed for a particular purpose, type of work, place etc专门的
portal [ˈpɔrt(ə)l]: n. literary a tall and impressive gate or entrance to a building入口
deoxyribonucleic [diˌɒksiraɪboʊnu'kliɪk] acid: DNA
protein [ˈproʊtin]: n. one of several natural substances that exist in food such as meat, eggs, and beans, and which your body needs in order to grow and remain strong and healthy[生化]蛋白质
amino [ə'mi:no]: adj. 氨基的
acid [ˈæsɪd]: n. a chemical substance that has a ↑pH of less than 7. Strong acids can burn holes in material or damage your skin[化]酸
mineral [ˈmɪn(ə)rəl]: n. a substance that is formed naturally in the earth, such as coal, salt, stone, or gold. Minerals can be dug out of the ground and used矿物, 矿石
lipid [ˈlɪpɪd]: n. technical one of several types of ↑fatty substances in living things, such as fat, oil, or ↑wax脂质, 油脂
a.k.a.: also known as, 又名..., 也叫作...
membrane [ˈmemˌbreɪn]: n. a very thin piece of skin that covers or connects parts of your body膜, 隔膜
interaction [ˌɪntərˈækʃən]: n. a process by which two or more things affect each other交互作用
crucial [ˈkruʃ(ə)l]: adj. something that is crucial is extremely important, because everything else depends on it SYN vital至关紧要的
phosphate [ˈfɑsˌfeɪt]: n. a substance containing a phosphate used for making plants grow better磷酸盐
molecule molecular [məˈlekjələr]: n.adj. the smallest unit into which any substance can be divided without losing its own chemical nature, usually consisting of two or more atoms[化]分子
tote [toʊt]: v. informal to carry something, especially regularly手提, 背负, 携带
biochemistry [ˌbaɪoʊˈkemɪstri]: n. the scientific study of the chemistry of living things生物化学
excess [ˈekˌses]: n. a larger amount of something than is allowed or needed超额
glycogen [ˈɡlaɪkədʒən]: n. 肝糖, 糖原质
bacteria [bækˈtɪriə]: n. very small living things, some of which cause illness or disease ⇨ virus细菌
-------------------
in the back of your fridge: 冰箱深处
sb. is a gleam in sb's eyes: A是B的构想
share the same basic goal: 拥有相同的基本目标
perpetuate sb's existence: 使某人永久存在
stay alive: 设法不死
set up a factory: 开办工厂
keep sb. doing sth.: 使某人做某事
assembly instructions: 装配说明
raw materials: 原材料
get paid: 获得报酬
send sth. off: to send a letter, document, or package by mail
assemble A. into B.: 将A组装成B
be transported to sp.: 被运送到某地
draw energy from sth.: 从某物那里获取能量
harsher working conditions: 艰苦的工作环境
be walled off: 被隔离起来
the rest of sth.: 某物剩余部分
be embedded into sth.: 被嵌入到某物
be built from sth.: 由某物建造
are derived from: to come or develop from something 来源于
in a pinch: in an emergency
minimum wage: 最低薪酬
be transferred between: to move someone or something from one place, vehicle, person, or group to another
in the face of sth.: 面对某事物
extreme challenges: 极限挑战
mobilize the immune system: 激起防御系统
