English/TED-Ed/2013-10-08 The operating system of life.html
<div id="outline-container-orgfad62bc" class="outline-3">
<h3 id="orgfad62bc">expression</h3>
<div class="outline-text-3" id="text-orgfad62bc">
<p>
oak [əʊk]: n. a large tree that is common in northern countries, or the hard wood of this tree橡树, 橡木<br />
acorn [ˈeɪˌkɔrn]: n. the nut of the ↑oak tree[植]橡树果<br />
tadpole [ˈtædˌpoʊl]: n. a small creature that has a long tail, lives in water, and grows into a frog or toad[动]蝌蚪<br />
mold [moʊld]: n. a soft green, grey, or black substance that grows on food which has been kept too long, and on objects that are in warm wet air ⇨ mouldy:霉菌<br />
solitary [ˈsɑləˌteri]: adj. used to emphasize that there is only one of something SYN single孤独的<br />
lifeform : n. 生物<br />
machinery [məˈʃinəri]: n. machines, especially large ones[总称] 机器, 机械<br />
mission [ˈmɪʃ(ə)n]: n. something that you feel you must do because it is your duty SYN calling, vocation使命, 任务<br />
currency [ˈkʌrənsi]: n. the system or type of money that a country uses货币<br />
blueprint [ˈbluˌprɪnt]: n. technical a pattern that all living cells contain, which decides how a person, animal, or plant develops and what it looks like蓝图<br />
photocopy [ˈfoʊtoʊˌkɑpi]: v. to make a photographic copy of something影印<br />
giant [ˈdʒaɪənt]: adj. extremely big, and much bigger than other things of the stype庞大的, 巨大的<br />
furnace [ˈfɜrnɪs]: n. a large container for a very hot fire, used to produce power, heat, or liquid metal炉子, 熔炉<br />
fuel [ˈfjuːəl]: n. a substance such as coal, gas, or oil that can be burned to produce heat or energy燃料<br />
scrap [skræp]: v. to get rid of an old machine, vehicle etc, and use its parts in some other way拆毁<br />
specialized [ˈspeʃ(ə)lˌaɪzd]: adj. trained, designed, or developed for a particular purpose, type of work, place etc专门的<br />
portal [ˈpɔrt(ə)l]: n. literary a tall and impressive gate or entrance to a building入口<br />
deoxyribonucleic [diˌɒksiraɪboʊnu'kliɪk] acid: DNA<br />
protein [ˈproʊtin]: n. one of several natural substances that exist in food such as meat, eggs, and beans, and which your body needs in order to grow and remain strong and healthy[生化]蛋白质<br />
amino [ə'mi:no]: adj. 氨基的<br />
acid [ˈæsɪd]: n. a chemical substance that has a ↑pH of less than 7. Strong acids can burn holes in material or damage your skin[化]酸<br />
mineral [ˈmɪn(ə)rəl]: n. a substance that is formed naturally in the earth, such as coal, salt, stone, or gold. Minerals can be dug out of the ground and used矿物, 矿石<br />
lipid [ˈlɪpɪd]: n. technical one of several types of ↑fatty substances in living things, such as fat, oil, or ↑wax脂质, 油脂<br />
a.k.a.: also known as, 又名&#x2026;, 也叫作&#x2026;<br />
membrane [ˈmemˌbreɪn]: n. a very thin piece of skin that covers or connects parts of your body膜, 隔膜<br />
interaction [ˌɪntərˈækʃən]: n. a process by which two or more things affect each other交互作用<br />
crucial [ˈkruʃ(ə)l]: adj. something that is crucial is extremely important, because everything else depends on it SYN vital至关紧要的<br />
phosphate [ˈfɑsˌfeɪt]: n. a substance containing a phosphate used for making plants grow better磷酸盐<br />
molecule molecular [məˈlekjələr]: n.adj. the smallest unit into which any substance can be divided without losing its own chemical nature, usually consisting of two or more atoms[化]分子<br />
tote [toʊt]: v. informal to carry something, especially regularly手提, 背负, 携带<br />
biochemistry [ˌbaɪoʊˈkemɪstri]: n. the scientific study of the chemistry of living things生物化学<br />
excess [ˈekˌses]: n. a larger amount of something than is allowed or needed超额<br />
glycogen [ˈɡlaɪkədʒən]: n. 肝糖, 糖原质<br />
bacteria [bækˈtɪriə]: n. very small living things, some of which cause illness or disease ⇨ virus细菌<br />
</p>
<hr />
<p>
in the back of your fridge: 冰箱深处<br />
sb. is a gleam in sb's eyes: A是B的构想<br />
share the same basic goal: 拥有相同的基本目标<br />
perpetuate sb's existence: 使某人永久存在<br />
stay alive: 设法不死<br />
set up a factory: 开办工厂<br />
keep sb. doing sth.: 使某人做某事<br />
assembly instructions: 装配说明<br />
raw materials: 原材料<br />
get paid: 获得报酬<br />
send sth. off: to send a letter, document, or package by mail<br />
assemble A. into B.: 将A组装成B<br />
be transported to sp.: 被运送到某地<br />
draw energy from sth.: 从某物那里获取能量<br />
harsher working conditions: 艰苦的工作环境<br />
be walled off: 被隔离起来<br />
the rest of sth.: 某物剩余部分<br />
be embedded into sth.: 被嵌入到某物<br />
be built from sth.: 由某物建造<br />
are derived from: to come or develop from something 来源于<br />
in a pinch: in an emergency<br />
minimum wage: 最低薪酬<br />
be transferred between: to move someone or something from one place, vehicle, person, or group to another<br />
in the face of sth.: 面对某事物<br />
extreme challenges: 极限挑战<br />
mobilize the immune system: 激起防御系统<br />
</p>
</div>
</div>
