English/TED-Ed/2013-10-08 The operating system of life.org
** sentences
in the back of your fridge: 冰箱深处
- My wife complained that a patch of mold began to appear in the back of our fridge.
- His aim is to molten the big piece of ice in the back of his fridge.
- My mom left a piece of bread in the back of my fridge in recognition of me.
sb. is a gleam in sb's eyes: A是B的构想
- Our baby is still being a gleam in our eyes.
- The probability of living in outer space is a gleam in our eyes.
- You used to be a gleam in your parents' eyes.
share the same basic goal: 拥有相同的基本目标
- The group of pop singers share the same basic goal: to make enough money to travel all over the world.
- It's hard for me to share my house with a girl who doesn't share the same basic goal.
- Sharing the same basic goal may be the basic building block of a marriage.
perpetuate sb's existence: 使某人永久存在
- Although he quaked in every limb and in his soul, he succeeded in perpetuating his existence during the war.
- The first aim of every life is to perpetuate his own life.
- It reminds me of an ant
		which was trying to perpetuate its existence while I played jokes on it.
stay alive: 设法不死
- The ants have eaten plenty of food to stay alive in the desert.
- It's a pity that he wasn't able to stay alive in the flood.
- It's incredible how he stayed alive when the volcanoes were erupting.
set up a factory: 开办工厂
- In the end, he managed to set up a factory which launches a telescope into space.
- He set up a factory which named after his daughter.
- It was wondering whether she succeeded in setting up a robot factory. 
keep sb. doing sth.: 使某人做某事
- She has kept her son who deserted in the war hiding for over ten years. 
- He kept his daughter laughing at the reception.
- I admired him for keeping everyone around him staying positive.
assembly instructions: 装配说明
- When the police arrived on the scene, they found the assembly instructions.
- It was not long before that we received the assembly instructions.
- Following assembly instructions, he managed to piece those together.
raw materials: 原材料
- The pretty girl invited me to collect raw materials.
- As raw materials began to accumulate, the warehouse soon became crowded.
- A cargo of raw materials will sail from Beijing to London.
get paid: 获得报酬
- As soon as agreement is reached about the salary, you will get paid.
- I was relieved to hear that my wife got paid.
- I didn't get paid on time and I was under a lot of pressure.
send sth. off: to send a letter, document, or package by mail
- This advertisement was sent off to protect baby elephants.
- The manager sent assembly instructions off to help his staff work better.
- These pigeons are going to send these letters off.
assemble A. into B.: 将A组装成B
- He assembled these woods into a car under a lot of pressure.
- He volunteers to assemble these materials into a toy.
- He managed to assemble these parts into a model in time to pass the test.
be transported to sp.: 被运送到某地
- A cargo of raw materials has been transported to Space X.
- For your safety, your companion was transported to the hospital.
- I noticed with dismay that the golden watches hadn't been transported to England.
draw energy from sth.: 从某物那里获取能量
- Your phone draws energy from the battery inside. 
- All lives on the earth draw energy from the sun more or less. 
- While swimming across the Channel, she must draw energy from liquid foods.
harsher working conditions: 艰苦的工作环境
- Workers can't stay alive in the harsher working conditions. 
- I might lose my life in the harsher working conditions.
- He often volunteers to repair bicycles in memory of his early harsher working conditions.
be walled off: 被隔离起来
- These rooms must have been walled off.
- The north area of London and the south area used to be walled off.
- She stated that the enclosure of these dogs should have been walled off. 
the rest of sth.: 某物剩余部分
- I will love you for the rest of my life.
- She tends to communicate with the rest of her classmates.
- I have eaten the rest of these meals.
be embedded into sth.: 被嵌入到某物
- The light is embedded into the ceiling.
- The battery is designed to be embedded into the phone.
- The bath was able to be embedded into your bathroom.
be built from sth.: 由某物建造
- Proteins prove to be built from amino acids.
- The diamonds are built from stones and sand.
- The house is specially built from iron and glass.
are derived from: to come or develop from something 来源于
- The assembly instructions are derived from the construction of the toy.
- The fats are derived from a special type of pig.
- My pocket money is usually derived from my aunts.
in a pinch: in an emergency
- In a pinch, she began to fight with gangsters with her bare hands.
- In a pinch, these two men quarreled bitterly and that argument must be settled by a fight.
- In a pinch, she stood up to speak in public.
minimum wage: 最低薪酬
- His boss squinted at him and just paid the minimum wage. 
- If you keep paid the minimum wage, I will quit.
- His boss proceeded to pay her the minimum wage.
be transferred between: to move someone or something from one place, vehicle, person, or group to another
- These days, the singer is being transferred between group A and group B.
- The spare parts must be transferred between these garages.
- The spare parts might have been transferred between these garages.
in the face of sth.: 面对某事物
- They were separated from each other in the face of the war.
- He lodged a complaint in the face of the delay of the train.
- He is sensitive about accepting criticism in the face of his parents.
extreme challenges: 极限挑战
- She always stays positive in the face of extreme challenges. 
- After extreme challenges, our company began to make a profit.
- While we are in the face of extreme challenges, we must make these rules official. 
mobilize the immune system: 激起防御系统
- She died of a rare disease that disables her to mobilize the immune system.
- Your body is mobilizing the immune system to fight against the invasion of bacteria.
- She can't mobilize her immune system because of a special type of virus.
