English/TED-Ed/2013-10-08 The operating system of life.html
<div id="outline-container-org9cca32b" class="outline-3">
<h3 id="org9cca32b">sentences</h3>
<div class="outline-text-3" id="text-org9cca32b">
<p>
in the back of your fridge: 冰箱深处<br />
</p>
<ul class="org-ul">
<li>My wife complained that a patch of mold began to appear in the back of our fridge.<br /></li>
<li>His aim is to molten the big piece of ice in the back of his fridge.<br /></li>
<li>My mom left a piece of bread in the back of my fridge in recognition of me.<br /></li>
</ul>
<p>
sb. is a gleam in sb's eyes: A是B的构想<br />
</p>
<ul class="org-ul">
<li>Our baby is still being a gleam in our eyes.<br /></li>
<li>The probability of living in outer space is a gleam in our eyes.<br /></li>
<li>You used to be a gleam in your parents' eyes.<br /></li>
</ul>
<p>
share the same basic goal: 拥有相同的基本目标<br />
</p>
<ul class="org-ul">
<li>The group of pop singers share the same basic goal: to make enough money to travel all over the world.<br /></li>
<li>It's hard for me to share my house with a girl who doesn't share the same basic goal.<br /></li>
<li>Sharing the same basic goal may be the basic building block of a marriage.<br /></li>
</ul>
<p>
perpetuate sb's existence: 使某人永久存在<br />
</p>
<ul class="org-ul">
<li>Although he quaked in every limb and in his soul, he succeeded in perpetuating his existence during the war.<br /></li>
<li>The first aim of every life is to perpetuate his own life.<br /></li>
<li>It reminds me of an ant<br />
which was trying to perpetuate its existence while I played jokes on it.<br /></li>
</ul>
<p>
stay alive: 设法不死<br />
</p>
<ul class="org-ul">
<li>The ants have eaten plenty of food to stay alive in the desert.<br /></li>
<li>It's a pity that he wasn't able to stay alive in the flood.<br /></li>
<li>It's incredible how he stayed alive when the volcanoes were erupting.<br /></li>
</ul>
<p>
set up a factory: 开办工厂<br />
</p>
<ul class="org-ul">
<li>In the end, he managed to set up a factory which launches a telescope into space.<br /></li>
<li>He set up a factory which named after his daughter.<br /></li>
<li>It was wondering whether she succeeded in setting up a robot factory.<br /></li>
</ul>
<p>
keep sb. doing sth.: 使某人做某事<br />
</p>
<ul class="org-ul">
<li>She has kept her son who deserted in the war hiding for over ten years.<br /></li>
<li>He kept his daughter laughing at the reception.<br /></li>
<li>I admired him for keeping everyone around him staying positive.<br /></li>
</ul>
<p>
assembly instructions: 装配说明<br />
</p>
<ul class="org-ul">
<li>When the police arrived on the scene, they found the assembly instructions.<br /></li>
<li>It was not long before that we received the assembly instructions.<br /></li>
<li>Following assembly instructions, he managed to piece those together.<br /></li>
</ul>
<p>
raw materials: 原材料<br />
</p>
<ul class="org-ul">
<li>The pretty girl invited me to collect raw materials.<br /></li>
<li>As raw materials began to accumulate, the warehouse soon became crowded.<br /></li>
<li>A cargo of raw materials will sail from Beijing to London.<br /></li>
</ul>
<p>
get paid: 获得报酬<br />
</p>
<ul class="org-ul">
<li>As soon as agreement is reached about the salary, you will get paid.<br /></li>
<li>I was relieved to hear that my wife got paid.<br /></li>
<li>I didn't get paid on time and I was under a lot of pressure.<br /></li>
</ul>
<p>
send sth. off: to send a letter, document, or package by mail<br />
</p>
<ul class="org-ul">
<li>This advertisement was sent off to protect baby elephants.<br /></li>
<li>The manager sent assembly instructions off to help his staff work better.<br /></li>
<li>These pigeons are going to send these letters off.<br /></li>
</ul>
<p>
assemble A. into B.: 将A组装成B<br />
</p>
<ul class="org-ul">
<li>He assembled these woods into a car under a lot of pressure.<br /></li>
<li>He volunteers to assemble these materials into a toy.<br /></li>
<li>He managed to assemble these parts into a model in time to pass the test.<br /></li>
</ul>
<p>
be transported to sp.: 被运送到某地<br />
</p>
<ul class="org-ul">
<li>A cargo of raw materials has been transported to Space X.<br /></li>
<li>For your safety, your companion was transported to the hospital.<br /></li>
<li>I noticed with dismay that the golden watches hadn't been transported to England.<br /></li>
</ul>
<p>
draw energy from sth.: 从某物那里获取能量<br />
</p>
<ul class="org-ul">
<li>Your phone draws energy from the battery inside.<br /></li>
<li>All lives on the earth draw energy from the sun more or less.<br /></li>
<li>While swimming across the Channel, she must draw energy from liquid foods.<br /></li>
</ul>
<p>
harsher working conditions: 艰苦的工作环境<br />
</p>
<ul class="org-ul">
<li>Workers can't stay alive in the harsher working conditions.<br /></li>
<li>I might lose my life in the harsher working conditions.<br /></li>
<li>He often volunteers to repair bicycles in memory of his early harsher working conditions.<br /></li>
</ul>
<p>
be walled off: 被隔离起来<br />
</p>
<ul class="org-ul">
<li>These rooms must have been walled off.<br /></li>
<li>The north area of London and the south area used to be walled off.<br /></li>
<li>She stated that the enclosure of these dogs should have been walled off.<br /></li>
</ul>
<p>
the rest of sth.: 某物剩余部分<br />
</p>
<ul class="org-ul">
<li>I will love you for the rest of my life.<br /></li>
<li>She tends to communicate with the rest of her classmates.<br /></li>
<li>I have eaten the rest of these meals.<br /></li>
</ul>
<p>
be embedded into sth.: 被嵌入到某物<br />
</p>
<ul class="org-ul">
<li>The light is embedded into the ceiling.<br /></li>
<li>The battery is designed to be embedded into the phone.<br /></li>
<li>The bath was able to be embedded into your bathroom.<br /></li>
</ul>
<p>
be built from sth.: 由某物建造<br />
</p>
<ul class="org-ul">
<li>Proteins prove to be built from amino acids.<br /></li>
<li>The diamonds are built from stones and sand.<br /></li>
<li>The house is specially built from iron and glass.<br /></li>
</ul>
<p>
are derived from: to come or develop from something 来源于<br />
</p>
<ul class="org-ul">
<li>The assembly instructions are derived from the construction of the toy.<br /></li>
<li>The fats are derived from a special type of pig.<br /></li>
<li>My pocket money is usually derived from my aunts.<br /></li>
</ul>
<p>
in a pinch: in an emergency<br />
</p>
<ul class="org-ul">
<li>In a pinch, she began to fight with gangsters with her bare hands.<br /></li>
<li>In a pinch, these two men quarreled bitterly and that argument must be settled by a fight.<br /></li>
<li>In a pinch, she stood up to speak in public.<br /></li>
</ul>
<p>
minimum wage: 最低薪酬<br />
</p>
<ul class="org-ul">
<li>His boss squinted at him and just paid the minimum wage.<br /></li>
<li>If you keep paid the minimum wage, I will quit.<br /></li>
<li>His boss proceeded to pay her the minimum wage.<br /></li>
</ul>
<p>
be transferred between: to move someone or something from one place, vehicle, person, or group to another<br />
</p>
<ul class="org-ul">
<li>These days, the singer is being transferred between group A and group B.<br /></li>
<li>The spare parts must be transferred between these garages.<br /></li>
<li>The spare parts might have been transferred between these garages.<br /></li>
</ul>
<p>
in the face of sth.: 面对某事物<br />
</p>
<ul class="org-ul">
<li>They were separated from each other in the face of the war.<br /></li>
<li>He lodged a complaint in the face of the delay of the train.<br /></li>
<li>He is sensitive about accepting criticism in the face of his parents.<br /></li>
</ul>
<p>
extreme challenges: 极限挑战<br />
</p>
<ul class="org-ul">
<li>She always stays positive in the face of extreme challenges.<br /></li>
<li>After extreme challenges, our company began to make a profit.<br /></li>
<li>While we are in the face of extreme challenges, we must make these rules official.<br /></li>
</ul>
<p>
mobilize the immune system: 激起防御系统<br />
</p>
<ul class="org-ul">
<li>She died of a rare disease that disables her to mobilize the immune system.<br /></li>
<li>Your body is mobilizing the immune system to fight against the invasion of bacteria.<br /></li>
<li>She can't mobilize her immune system because of a special type of virus.<br /></li>
</ul>
</div>
</div>
