English/TED-Ed/2013-10-08 The operating system of life.org
** summary writting
#+begin_verse
All organisms which were once one solitary cell share the same basic goal:
	to perpetuate their existence.
Image a factory full of robots have two missions:
	to keep the factory running and to set up a new factory at the right time.
It has an office with blueprints for its configurations
	and sets of instructions to make robots,
	some of which photocopy these instructions
		and send them off to help make the building block of more robots,
	some of which assemble those parts into more robots
		and give these robots the necessary tools to start working.
Every robot draws energy from a giant furnace
	that not only burn regular fuel but also scarp materials in a pinch.
Although the furnace is walled off,
	the robots inside can interact with the rest of the factory through specialized portals.
The factory we're describing here is a cell.
The blueprints, photocopied instructions, robots, and wall
	respectively are DNA, RNA, proteins, and fats.
They work together to keep our lives running smoothly in the face of some extreme challenges.
#+end_verse
