English/TED-Ed/2013-10-08 The operating system of life.html
<div id="outline-container-org3f26d9f" class="outline-3">
<h3 id="org3f26d9f">summary writting</h3>
<div class="outline-text-3" id="text-org3f26d9f">
<p class="verse">
All organisms which were once one solitary cell share the same basic goal:<br />
&#xa0;to perpetuate their existence.<br />
Image a factory full of robots have two missions:<br />
&#xa0;to keep the factory running and to set up a new factory at the right time.<br />
It has an office with blueprints for its configurations<br />
&#xa0;and sets of instructions to make robots,<br />
&#xa0;some of which photocopy these instructions<br />
&#xa0;&#xa0;and send them off to help make the building block of more robots,<br />
&#xa0;some of which assemble those parts into more robots<br />
&#xa0;&#xa0;and give these robots the necessary tools to start working.<br />
Every robot draws energy from a giant furnace<br />
&#xa0;that not only burn regular fuel but also scarp materials in a pinch.<br />
Although the furnace is walled off,<br />
&#xa0;the robots inside can interact with the rest of the factory through specialized portals.<br />
The factory we're describing here is a cell.<br />
The blueprints, photocopied instructions, robots, and wall<br />
&#xa0;respectively are DNA, RNA, proteins, and fats.<br />
They work together to keep our lives running smoothly in the face of some extreme challenges.<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
